# -*- coding: utf-8 -*-
# @Time    : 2022/10/18 22:16
# @Author  : pat
# @FileName: do2_dict_print.py
# @Software: PyCharm

"""一个字典中，存放了10个学生的学号（key）和分数（value）；请筛选输出，大于80分的同学（按照格式：学号：分数）"""

dic = {1: {"学号": 1001, "成绩": 99}, 2: {"学号": 1002, "成绩": 90}, 3: {"学号": 1003, "成绩": 50}, 4: {"学号": 1004, "成绩": 59},
       5: {"学号": 1005, "成绩": 0}, 6: {"学号": 1006, "成绩": 32}, 7: {"学号": 1007, "成绩": 100}, 8: {"学号": 1008, "成绩": 10},
       9: {"学号": 1009, "成绩": 66}, 10: {"学号": 1010, "成绩": 56}}

for i in dic:
    if dic[i].get("成绩") > 80:
        print(dic[i].values())
