# -*- coding: utf-8 -*-
# @Time    : 2022/10/19 23:21
# @Author  : pat
# @FileName: do8_staffdata.py
# @Software: PyCharm

"""设计一个数据结构，用来存放10个员工的信息并初始化，每个员工信息包括：工号，姓名，工龄，工资；将这10个员工，按照工资从高到低打印输出；
   提示：可以组合使用我们的序列数据类型"""

dic = [{"工号": 1001, "姓名": 'q', "工龄": 10, "工资": 10000}, {"工号": 1002, "姓名": 'y', "工龄": 13, "工资": 6000},
       {"工号": 1003, "姓名": 'w', "工龄": 9, "工资": 8000}, {"工号": 1004, "姓名": 'u', "工龄": 5, "工资": 10000},
       {"工号": 1005, "姓名": 'e', "工龄": 8, "工资": 2000}, {"工号": 1006, "姓名": 'i', "工龄": 42, "工资": 50000},
       {"工号": 1007, "姓名": 'r', "工龄": 7, "工资": 7000}, {"工号": 1008, "姓名": 'o', "工龄": 25, "工资": 20000},
       {"工号": 1009, "姓名": 't', "工龄": 6, "工资": 5000}, {"工号": 1010, "姓名": 'p', "工龄": 1, "工资": 2000}]
dic = sorted(dic, key=lambda x: x["工资"], reverse=True)
for i in dic:
    print(i["工号"], i["姓名"], i["工龄"], i["工资"])
